Repository: Senior-ai/DiamondProjectDelivery
Catalog: ClientsBot/locale/*/LC_MESSAGES/messages.po
Languages: he

# start_message
source: 👋 Hello, I am MAZAL, and I'm here to assist you in finding the perfect diamond. 💎 Using our service, you can easily search for diamonds that match your criteria by simply typing your requirements.
he: 👋 שלום לך, אני MAZAL, ואני כאן כדי לעזור לך למצוא את היהלום המושלם. 💎 באמצעות השירות שלנו, תוכל לחפש בקלות יהלומים התואמים את הקריטריונים שלך על ידי הקלדת הדרישות שלך.

# help_message
source: 📋 **Available Commands:** 🔹 /start: Start the bot. This command initiates interaction with the bot. 🔹 /settings: Open the settings menu. Allows you to change the language. 🔹 /help: Get a list of available commands with brief descriptions.
he: 📋 **פקודות זמינות:** 🔹 /start: להתחיל את הבוט. פקודה זו מתחילה את האינטראקציה עם הבוט. 🔹 /settings: לפתוח את תפריט ההגדרות. מאפשר לשנות את השפה. 🔹 /help: קבלת רשימת פקודות זמינות עם תיאורים קצרים.

# unknown_command_error
source: ❌ Error: Unknown command.
he: ❌ שגיאה: פקודה לא מוכרת.

# lost_context_error
source: ❌ Lost context. Please, try needed command again.
he: ❌ איבוד הקשר. נא לנסות שוב את הפקודה הנדרשת.

# settings_message
source: ⚙️ Settings: 🌍 Your current language: English
he: ⚙️ הגדרות: 🌍 השפה הנוכחית שלך: אנגלית

# change_language_button
source: Change language
he: שנה שפה

# choose_new_language_prompt
source: Choose language:
he: בחר שפה:

# choose_new_language_callback_query_reply
source: Please, choose new language.
he: נא לבחור שפה חדשה.

# english_language_option_button
source: English
he: אנגלית

# hebrew_language_option_button
source: Hebrew
he: עברית

# settings_session_expired_message
source: ⏰ Your settings session has expired. Please, open settings again using /settings command.
he: ⏰ מושב ההגדרות שלך פג תוקף. נא לפתוח את ההגדרות שוב באמצעות הפקודה /settings.

# close_button
source: Close
he: סגור

# back_button
source: Back
he: חזור

source: Language was changed to: {}
he: השפה שונתה ל: {}

# no_matching_sellers_response
source: 🤔 No matching sellers found.
he: 🤔 לא נמצאו מוכרים מתאימים.

# search_query_processed_response
source: ✅ Notified sellers about your search query: {}
he: ✅ המוכרים הודעו על חיפושך: {}

# not_enough_data_about_diamonds_response
source: ❌ Not enough data about diamond. ℹ️ You have to provide at least one diamond with all of the following parameters: carat, color, clarity, shape. ⚠️ Please, note, that diamonds with not enough data will be ignored.
he: ❌ אין מספיק נתונים על היהלום. ℹ️ עליך לספק לפחות יהלום אחד עם כל הפרמטרים הבאים: קראט, צבע, ניקיון, צורה. ⚠️ נא לציין כי יהלומים ללא מספיק נתונים יימחקו.

# share_contact_button
source: Share Contact
he: שתף קשר

# please_share_your_contact_information_prompt
source: ℹ️ Please, share your contact information with us. ✅ This will allow sellers to contact you. ⚠️ Please, note, that you'll not be able to search for stones without sharing your contact information.
he: ℹ️ נא לשתף את פרטי הקשר שלך איתנו. ✅ זה יאפשר למוכרים ליצור איתך קשר. ⚠️ נא לציין שלא תוכל לחפש אבנים ללא שיתוף פרטי הקשר שלך.

# contact_information_saved_successfully
source: ✅ Thanks! Your contact information was saved successfully. Now, you can search for stones, just type what you need.
he: ✅ תודה! פרטי הקשר שלך נשמרו בהצלחה. כעת תוכל לחפש אבנים, פשוט הקלד מה שאתה צריך.

# contact_information_updated_successfully
source: ✅ Your contact information was updated successfully.
he: ✅ פרטי הקשר שלך עודכנו בהצלחה.

# contacts_not_shared_response
source: ❌ You have to share your contact information to search for stones. 👇 Please, share your contact information using the button below.
he: ❌ עליך לשתף את פרטי הקשר שלך כדי לחפש אבנים. 👇 נא לשתף את פרטי הקשר שלך באמצעות הכפתור למטה.

source: ⏳ Processing your search query...
he: ⏳ מעבד את חיפושך...

# no_diamonds_in_message_response
source: ❌ No concrete diamonds found in your message. ℹ️ Please, provide at least one diamond with shape, color, clarity and carats.
he: ❌ לא נמצאו יהלומים ספציפיים בהודעתך. ℹ️ נא לספק לפחות יהלום אחד עם צורה, צבע, ניקיון וקראט.

source: ❌ You can't share contact information of another user.
he: ❌ אינך יכול לשתף פרטי קשר של משתמש אחר.

# educational_message_1
source: ℹ️ Information about the 4Cs of diamonds: Carat - The weight of the diamond. The higher the carat, the heavier the diamond. Color - Diamonds come in a variety of colors, with colorless being the rarest. Clarity - The level of inclusions or blemishes in the diamond. The higher the clarity, the fewer the blemishes. Cut - How the diamond is cut and shaped. The cut affects the diamond's brilliance and sparkle.
he: ℹ️ מידע על 4 ה-C של היהלומים: קרט - משקל היהלום. ככל שמשקל הקרט גבוה יותר, היהלום כבד יותר. צבע - יהלומים מגיעים במגוון צבעים, כאשר חסרי הצבע הם הנדירים ביותר. ניקיון - רמת התכלילים או הפגמים ביהלום. ככל שהניקיון גבוה יותר, כך פחות פגמים. חיתוך - איך היהלום חתוך ומעוצב. החיתוך משפיע על הברק והניצוץ של היהלום.

# educational_message_2
source: ℹ️ Did you know about the 4Cs of diamonds? Carat - Refers to the diamond's weight. Higher carat weight means a larger diamond. Color - Diamonds range in color. Colorless diamonds are the most valued. Clarity - Indicates the purity of the diamond. Higher clarity means fewer internal flaws. Cut - The quality of a diamond's cut affects its light performance and beauty.
he: ℹ️ האם ידעתם על 4 ה-C של היהלומים? קרט - מתייחס למשקל היהלום. משקל קרט גבוה יותר משמעו יהלום גדול יותר. צבע - יהלומים נעים בצבעים שונים. יהלומים חסרי צבע הם בעלי הערך הגבוה ביותר. ניקיון - מציין את טוהר היהלום. ניקיון גבוה יותר אומר פחות פגמים פנימיים. חיתוך - איכות החיתוך של היהלום משפיעה על ביצועי האור והיופי שלו.

# educational_message_3
source: ℹ️ Learn about the 4Cs that define a diamond's quality: Carat - Measures the weight of the diamond. Larger carat weight signifies a bigger diamond. Color - Diamonds have different colors, with the most prized being colorless. Clarity - Denotes the presence of inclusions. Higher clarity diamonds are more valuable. Cut - The precision of the diamond's cut influences its brilliance and sparkle.
he: ℹ️ למדו על 4 ה-C שמגדירים את איכות היהלום: קרט - מודד את משקל היהלום. משקל קרט גדול יותר מציין יהלום גדול יותר. צבע - יהלומים מגיעים בצבעים שונים, כאשר חסרי הצבע הם בעלי הערך הגבוה ביותר. ניקיון - מציין את נוכחות התכלילים. יהלומים בעלי ניקיון גבוה יותר הם בעלי ערך רב יותר. חיתוך - הדיוק בחיתוך היהלום משפיע על הברק והניצוץ שלו.

# educational_message_4
source: ℹ️ Understanding the 4Cs of diamonds can help you make an informed purchase: Carat - Indicates the weight and size of the diamond. Bigger diamonds have higher carats. Color - Diamonds can be found in various colors, with the rarest being colorless. Clarity - Refers to the imperfections within the diamond. Fewer imperfections mean higher clarity. Cut - A well-cut diamond will reflect light better, enhancing its overall appearance.
he: ℹ️ הבנת 4 ה-C של היהלומים יכולה לעזור לכם לבצע רכישה מושכלת: קרט - מציין את משקל וגודל היהלום. יהלומים גדולים יותר הם בעלי משקל קרט גבוה יותר. צבע - יהלומים מגיעים במגוון צבעים, כאשר חסרי הצבע הם הנדירים ביותר. ניקיון - מתייחס לפגמים בתוך היהלום. פחות פגמים משמע ניקיון גבוה יותר. חיתוך - יהלום חתוך היטב ישקף אור בצורה טובה יותר, ויעצים את המראה הכללי שלו.

# message_without_text_response
source: 🔍 Text is required for the search query. Please, provide your query in text format.
he: 🔍 טקסט נדרש עבור שאילתת החיפוש. אנא ספק את השאילתה בפורמט טקסט.
