Repository: Senior-ai/DiamondProjectDelivery
Catalog: SellersBot/locale/*/LC_MESSAGES/messages.po
Languages: he

source: start_message
he: שלום לך, אני MAZAL ואני כאן כדי לעשות לך סדר. לכולנו קשה לעקוב אחר כל הביקושים שיש בקבוצות, וזה יוצר מצב שאנחנו מפספסים מכירות… בשביל שזה לא יקרה, תוכל להעלות את המלאי שלך בקובץ אקסל, ואנחנו נדאג שבכל פעם שמישהו מחפש את האבנים שיש לך, תקבל הודעה אוטומטית שמישהו מחפש את האבן. הודעה זו תכלול את הפרמטרים של האבן ואפשרות ליצור קשר עם הקונה בלחיצת כפתור פשוטה, ככה לא תצטרך לעקוב כל יום אחר הקבוצה. ההודעות פשוט יגיעו אליך אוטומטית בפרטי. לפני שאנחנו מתחילים, לחץ על הכפתור מטה להרשמה כמנוי. עלות השירות שלנו היא 10.99$ לחודש. אל תדאג, תוכל לרשום את החשבונית על שם החברה שלך.

source: help_message
he: 📋 **פקודות זמינות:** 🔹 /start: מתחיל את הבוט. פקודה זו מתחילה את האינטראקציה עם הבוט ומאפשרת לבצע תשלום. 🔹 /settings: תפריט הגדרות. מאפשר לשנות את השפה. 🔹 /sold: סימון יהלום כנמכר. ספק את מספר המלאי של היהלום, והבוט יעדכן את בסיס הנתונים המרכזי ויסיר אותו מהמלאי הזמין. 🔹 /help: קבלת רשימת פקודות זמינות עם תיאורים קצרים.

source: unknown_command_error
he: ❌ שגיאה: פקודה לא מוכרת.

source: lost_context_error
he: ❌ איבוד הקשר. נא לנסות שוב את הפקודה הנדרשת.

source: settings_message
he: ⚙️ הגדרות: 🌍 השפה הנוכחית שלך: אנגלית

source: change_language_button
he: שנה שפה

source: choose_new_language_prompt
he: בחר שפה:

source: choose_new_language_callback_query_reply
he: נא לבחור שפה חדשה.

source: english_language_option_button
he: אנגלית

source: hebrew_language_option_button
he: עברית

source: settings_session_expired_message
he: ⏰ מושב ההגדרות שלך פג תוקף. נא לפתוח את ההגדרות שוב באמצעות הפקודה /settings.

source: close_button
he: סגור

source: back_button
he: חזור

source: language_was_changed_to_{}
he: השפה שונתה ל: {}

source: interested_client_present_notification
he: 🔒 יש לקוח שמתעניין ביהלומים שלך! צור איתו קשר כדי לדון בפרטים! 🔍 יהלומים שנחפשו: {} 📦 יהלומים דומים מהמלאי שלך: ``` {} ```

source: free_interested_client_present_notification
he: 🔒 יהלומים מהמלאי שלך נצפו בקבוצה! צור קשר עם האדם לדון בפרטים! 🔍 יהלומים שנחפשו: {} 📦 יהלומים דומים מהמלאי שלך: ``` {} ```

source: subscription_activated_notification
he: ✅ המנוי הופעל! 💡 עכשיו תקבל הודעות על לקוחות חדשים שמתעניינים. 💡 כמו כן תוכל לשלוח את המלאי שלך כקובץ .csv כדי לקבל הודעות על לקוחות שמתעניינים!

source: invalid_file_type_error
he: ❌ סוג קובץ לא תקין. עליך לשלוח קובץ CSV.

source: invalid_header_in_csv_file_error
he: ❌ כותרת לא תקינה בקובץ CSV. {}

source: invalid_row_in_csv_file_error
he: ❌ שורה לא תקינה בקובץ CSV. {}

source: invalid_value_in_csv_file_error
he: ❌ ערך לא תקין בקובץ CSV. {}

source: csv_file_error
he: ❌ שגיאה בקובץ CSV. {}

source: list_of_pairs_preview
he: 📦 תצוגת זוגות: ``` {} ```

source: csv_file_processed_successfully_with_pairs
he: ✅ הקובץ CSV עובד בהצלחה. 📦 הנה רשימת הזוגות המלאה.

source: csv_file_processed_successfully_without_pairs
he: ✅ הקובץ CSV עובד בהצלחה. ℹ️ לא נמצאו זוגות.

source: user_does_not_have_active_subscription
he: ℹ️ למשתמש אין מנוי פעיל.

source: user_removed_from_paid_successfully
he: ✅ המשתמש הוסר בהצלחה מהרשימה בתשלום.

source: remove_from_paid_invalid_arguments_amount
he: ❌ כמות ארגומנטים לא תקינה לפקודת remove_from_paid. ℹ️ עליך לספק מזהה משתמש. 💡 לדוגמה: ```/remove_from_paid 123456789```

source: remove_from_paid_invalid_user_id
he: ❌ מזהה משתמש לא תקין לפקודת remove_from_paid. 💡 מזהה משתמש הוא מספר שניתן לקבל מבוטים כמו @userinfobot.

source: activate_subscription_button
he: הפעל מנוי

source: activate_subscription_suggestion
he: ❌ אין לך מנוי פעיל של מוכר. 👇 לחץ על הכפתור למטה כדי להפעיל את המנוי שלך.

source: buy_client_contacts_button
he: קנה פרטי קשר

source: cant_use_sold_command_without_of_subscription
he: ❌ מצטערים, אבל אינך יכול להשתמש בפקודת /sold ללא מנוי פעיל. 💡 נא לקנות מנוי ולנסות שוב.

source: invalid_argument_of_sold_command
he: ❌ שימוש לא תקין בפקודת sold. 💡 יש להשתמש בפקודה כך: ``` /sold 123 ``` אשר בו 123 הוא מזהה האבן.

source: invalid_amount_of_sold_command_arguments
he: ❌ שימוש לא תקין בפקודת sold. ℹ️ עליך לספק פרמטר אחד: מזהה האבן. 💡 לדוגמה: ``` /sold 123 ``` אשר בו 123 הוא מזהה האבן.

source: diamond_is_already_sold_or_was_not_in_your_stock
he: ❌ היהלום הזה כבר נמכר או לא היה במלאי שלך.

source: diamond_sold_successfully
he: ✅ היהלום נמכר בהצלחה.

source: client_not_found_notification
he: ❌ מצטערים, אירעה שגיאה פנימית במהלך חיפוש פרטי הקשר של הלקוח במאגר הנתונים. 💡 נא לפנות לצוות התמיכה כדי לפתור את הבעיה. 🙏 אל תדאג, בקשת התשלום שלך נשמרה.

source: total_diamonds_limit_exceeded_error
he: ❌ חרגת ממגבלת מספר היהלומים הכוללת.

source: diamonds_per_load_limit_exceeded_error
he: ❌ חרגת ממגבלת מספר היהלומים לטעינה. 💡 נא לוודא שיש לך מקסימום של {} יהלומים בקובץ.

source: no_active_subscription_found_error
he: ❌ נראה שאין לך מנוי פעיל. 💡 נא לקנות מנוי ולנסות שוב.

source: b2b_group_link_button
he: קבוצת B2B

source: from_{from_value}_to_{to_value}
he: מ-{from_value} ל-{to_value}

source: not_specified
he: לא צוין

source: Color: {color}
he: צבע: {color}

source: Clarity: {clarity}
he: ניקיון: {clarity}

source: Carat: {carat}
he: קראט: {carat}

source: Shape: {shape}
he: צורה: {shape}

source: Diamond - {details}
he: 💎 - {details}

source: contacts_not_shared_response
he: ❌ עליך לשתף את פרטי הקשר שלך כדי לחפש אבנים בקבוצה. 👇 נא לשתף את פרטי הקשר שלך באמצעות הכפתור למטה.

source: contact_information_saved_successfully
he: ✅ תודה! פרטי הקשר שלך נשמרו בהצלחה.

source: contact_information_updated_successfully
he: ✅ פרטי הקשר שלך עודכנו בהצלחה.

source: share_contact_button
he: שתף קשר

source: no_matching_sellers_response
he: 🤔 לא נמצאו מוכרים מתאימים.

source: search_query_processed_response
he: ✅ המוכרים הודעו על חיפושך: {}

source: not_enough_data_about_diamonds_response
he: ❌ אין מספיק נתונים על היהלום. ℹ️ עליך לספק לפחות יהלום אחד עם כל הפרמטרים הבאים: קראט, צבע, ניקיון, צורה. ⚠️ נא לציין כי יהלומים ללא מספיק נתונים יימחקו.

source: file_with_complete_list_of_similar_diamonds
he: 📦 הנה רשימת יהלומים דומים מלאה

source: b2b_group_link_message
he: 📩 הצטרף לקבוצת B2B שלנו!

source: Value "{value}" is not valid.
he: הערך "{value}" אינו תקין.

source: Value "{value}" is not valid in row {row}, column "{column}".
he: הערך "{value}" אינו חוקי בשורה {row}, עמודה "{column}".

source: Value "{value}" is not numeric.
he: הערך "{value}" אינו מספרי.

source: Value "{value}" is not numeric in row {row}, column "{column}".
he: הערך "{value}" אינו מספרי בשורה {row}, עמודה "{column}".

source: Value "{value}" is not an integer.
he: הערך "{value}" אינו מספר שלם.

source: Value "{value}" is not an integer in row {row}, column "{column}".
he: הערך "{value}" אינו מספר שלם בשורה {row}, עמודה "{column}".

source: Any text value expected.
he: מצופה ערך טקסט כלשהו.

source: Any text value expected in row {row}, column "{column}".
he: מצופה ערך טקסט כלשהו בשורה {row}, עמודה "{column}".

source: Value "{value}" is not a measurements.
he: הערך "{value}" אינו מידות.

source: Value "{value}" is not a valid measurements in row {row}, column "{column}".
he: הערך "{value}" אינו מידות חוקיות בשורה {row}, עמודה "{column}".

source: Value "{value}" is not a valid option.
he: הערך "{value}" אינו אפשרות חוקית.

source: Value "{value}" is not a valid option in row {row}, column "{column}".
he: הערך "{value}" אינו אפשרות חוקית בשורה {row}, עמודה "{column}".

source: Value "{value}" is not a valid URL.
he: הערך "{value}" אינו כתובת URL חוקית.

source: Value "{value}" is not a valid URL in row {row}, column "{column}".
he: הערך "{value}" אינו כתובת URL חוקית בשורה {row}, עמודה "{column}".

source: File is not a CSV file.
he: הקובץ אינו קובץ CSV.

source: file_too_large_error
he: ❌ קובץ גדול מדי. יש להשתמש בקובץ בפורמט CSV.

source: Unable to process csv file. {errors}
he: ❌ לא ניתן לעבד את קובץ ה-CSV. {errors}

source: instructions_file_description
he: 📄 אנא עקוב אחר ההוראות להלן להכנת הקובץ עבור הבוט.
